package HW3.hw;

public class Main {
    public static void main(String[] args) {
        Director director = new Director();

        System.out.println(director.counter);

    }
}
/**
Создать интерфейс Counter бухгалтер, в котором будет один метод, который возвращает отчет в виде строки, а в качестве параметра
принимает количество месяцев за которые этот отчет должен быть сделан.


Создать класс директор у которого один метод force, который в качестве параметра принимает объект типа counter и переменную int,
которая хранит число месяцев за которые нужно сделать отчет. В этом методе мы должны получить отчет у бухгалтера и вывести его на экран Т.е. директор требует отчет у бухгалетра - первый аргумент, за какое-то кол-во месяцев - второй аргумент, результатом выполнения метода
будет строка на экране вида «Отчет за і месяцев»


Реализовать выполнение метода force двумя способами - первый - создание объекта реализующего метода и передача его в качестве параметра,
а второй - использование анонимного метода.
 */